; domain
(define (domain miconic)
(:requirements :typing)
(:types floor passenger)

(:predicates
    (origin ?person - passenger ?floor - floor)
    (destin ?person - passenger ?floor - floor)
    (above ?floor1 - floor ?floor2 - floor)
    (boarded ?person - passenger)
    (served ?person - passenger)
    (lift-at ?floor - floor))

(:action board
    :parameters (?f - floor ?p - passenger)
    :precondition (and (lift-at ?f) (origin ?p ?f))
    :effect (boarded ?p))

(:action depart
    :parameters (?f - floor ?p - passenger)
    :precondition (and (lift-at ?f) (destin ?p ?f) (boarded ?p))
    :effect (and (not (boarded ?p))          (served ?p))) ;;drive up

(:action up
    :parameters (?f1 - floor ?f2 - floor)
    :precondition (and (lift-at ?f1) (above ?f1 ?f2))
    :effect (and (lift-at ?f2) (not (lift-at ?f1))))   ;;drive down

(:action down
    :parameters (?f1 - floor ?f2 - floor)
    :precondition (and (lift-at ?f1) (above ?f2 ?f1))
    :effect (and (lift-at ?f2) (not (lift-at ?f1))))

)

; problem
(define (problem mixed-f3-p3-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 - passenger
             f0 f1 f2 - floor)


(:init
(above f0 f1)
(above f0 f2)

(above f1 f2)



(origin p0 f1)
(destin p0 f2)

(origin p1 f1)
(destin p1 f0)

(origin p2 f1)
(destin p2 f2)






(lift-at f0)
)


(:goal (and
(served p0)
(served p1)
(served p2)
))
)

; plan
1. (up f0 f1)
   deleted: (lift-at f0)
   added: (lift-at f1)
   goals met: 0 of 3
2. (board f1 p0)
   added: (boarded p0)
   goals met: 0 of 3
3. (board f1 p1)
   added: (boarded p1)
   goals met: 0 of 3
4. (board f1 p2)
   added: (boarded p2)
   goals met: 0 of 3
5. (down f1 f0)
   deleted: (lift-at f1)
   added: (lift-at f0)
   goals met: 0 of 3
6. (up f0 f2)
   deleted: (lift-at f0)
   added: (lift-at f2)
   goals met: 0 of 3
7. (depart f2 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 1 of 3
8. (depart f2 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 2 of 3
9. (down f2 f0)
   deleted: (lift-at f2)
   added: (lift-at f0)
   goals met: 2 of 3
10. (depart f0 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 3 of 3
